---
title: FillPatternElement
classe: Autodesk.Revit.DB.FillPatternElement
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# FillPatternElement

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FillPatternElement Create(Document, FillPattern)` | `FillPatternElement.Create(document, fillPattern)` | FillPatternElement |
| `FillPattern GetFillPattern()` | `fillPatternElement.GetFillPattern()` | FillPattern |
| `FillPatternElement GetFillPatternElementByName(Document, FillPatternTarget, String)` | `FillPatternElement.GetFillPatternElementByName(document, target, name)` | FillPatternElement |
| `Void SetFillPattern(FillPattern)` | `fillPatternElement.SetFillPattern(newFillPattern)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```